#pragma once

#if __has_include("Definitions.hpp")
#include "Definitions.hpp"
#else
using char8 = char;
using char16 = char16_t;
using char32 = char32_t;
using uint8 = unsigned char;
using int8 = signed char;
using uint16 = unsigned short;
using int16 = signed short;
using uint32 = unsigned int;
using int32 = signed int;
using uint64 = unsigned long long;
using int64 = signed long long;
using int128 = __int128_t;
using uint128 = __uint128_t;
using float32 = float;
using float64 = double;

#ifndef INLINE
#define INLINE __attribute__((always_inline))
#endif

#ifndef ASSUME_ALIGNED
#define ASSUME_ALIGNED(address, alignment) __builtin_assume_aligned(address, alignment)
#endif

#endif

#if __has_include("TypeTraits.hpp")
#include "TypeTraits.hpp"
#else
#include <type_traits>
namespace TypeTrait
{
    template<typename T>
    concept IsInteger = std::is_integral<T>::value;

    template<typename T>
    concept IsFloatingPoint = std::is_floating_point_v<T>;

    template<typename T>
    concept IsSigned = std::is_signed<T>::value;

    template<uint64... Ns>
    struct IndexSequence{};

    template<uint64 N, uint64... Is>
    auto MakeIndexSequenceImpl()
    {
        if constexpr(N == 0)
        {
            return IndexSequence<Is...>();
        }
        else
        {
            return MakeIndexSequenceImpl<N - 1, N - 1, Is...>();
        }
    }

    template<uint64 N>
    using MakeIndexSequence = typename std::decay<decltype(MakeIndexSequenceImpl<N>())>::type;

    template<typename T>
    using Pure = std::remove_cv_t<std::remove_reference_t<T>>;
}
#endif

#if __has_include("Memory.hpp")
#include "Memory.hpp"
#else
namespace Memory
{
    template<typename TargetType, typename SourceType>
    INLINE constexpr void Copy(TargetType* Destination, const SourceType* Source, const uint64 Num)
    {
        __builtin_memcpy(Destination, Source, Num);
    }
}
#endif

#ifndef BUILTIN
#define BUILTIN(name) __builtin_ia32_##name
#endif

#ifndef MIN_VECTOR_WIDTH
#define MIN_VECTOR_WIDTH(width) __attribute__((min_vector_width(width)))
#endif

#ifdef __AVX__
#define AVX128 __AVX__
#pragma message "AVX128 supported"
#endif
#ifdef __AVX2__
#define AVX256 __AVX2__
#pragma message "AVX256 supported"
#endif
#ifdef __AVX512F__
#define AVX512 __AVX512__
#pragma message "AVX512 supported"
#endif

template<typename T>
using Vector4 = T __attribute__((vector_size(4), aligned(4)));

using char8_4 = Vector4<char8>;
static_assert(alignof(char8_4) == 4);

using uint8_4 = Vector4<uint8>;
static_assert(alignof(uint8_4) == 4);

using int8_4 = Vector4<int8>;
static_assert(alignof(int8_4) == 4);

using uint16_2 = Vector4<uint16>;
static_assert(alignof(uint16_2) == 4);

using int16_2 = Vector4<int16>;
static_assert(alignof(int16_2) == 4);

template<typename T>
using Vector8 = T __attribute__((vector_size(8), aligned(8)));

using char8_8 = Vector8<char8>;
static_assert(alignof(char8_8) == 8);

using uint8_8 = Vector8<uint8>;
static_assert(alignof(uint8_8) == 8);

using int8_8 = Vector8<int8>;
static_assert(alignof(int8_8) == 8);

using uint16_4 = Vector8<uint16>;
static_assert(alignof(uint16_4) == 8);

using int16_4 = Vector8<int16>;
static_assert(alignof(int16_4) == 8);

using uint32_2 = Vector8<uint32>;
static_assert(alignof(uint32_2) == 8);

using int32_2 = Vector8<int32>;
static_assert(alignof(int32_2) == 8);

using float32_2 = Vector8<float32>;
static_assert(alignof(float32_2) == 8);

template<typename T>
using Vector16 = T __attribute__((vector_size(16), aligned(16)));

using char8_16 = Vector16<char8>;
static_assert(alignof(char8_16) == 16);

using char16_8 = Vector16<char16>;
static_assert(alignof(char16_8) == 16);

using char32_4 = Vector16<char32>;
static_assert(alignof(char32_4) == 16);

using uint8_16 = Vector16<uint8>;
static_assert(alignof(uint8_16) == 16);

using int8_16 = Vector16<int8>;
static_assert(alignof(int8_16) == 16);

using uint16_8 = Vector16<uint16>;
static_assert(alignof(uint16_8) == 16);

using int16_8 = Vector16<int16>;
static_assert(alignof(int16_8) == 16);

using uint32_4 = Vector16<uint32>;
static_assert(alignof(uint32_4) == 16);

using int32_4 = Vector16<int32>;
static_assert(alignof(int32_4) == 16);

using uint64_2 = Vector16<uint64>;
static_assert(alignof(uint64_2) == 16);

using int64_2 = Vector16<int64>;
static_assert(alignof(int64_2) == 16);

using float32_4 = Vector16<float32>;
static_assert(alignof(float32_4) == 16);

using float64_2 = Vector16<float64>;
static_assert(alignof(float64_2) == 16);

template<typename T>
using Vector32 = T __attribute__((vector_size(32), aligned(32)));

using char8_32 = Vector32<char8>;
static_assert(alignof(char8_32) == 32);

using char16_16 = Vector32<char16>;
static_assert(alignof(char16_16) == 32);

using char32_8 = Vector32<char32>;
static_assert(alignof(char32_8) == 32);

using uint8_32 = Vector32<uint8>;
static_assert(alignof(uint8_32) == 32);

using int8_32 = Vector32<int8>;
static_assert(alignof(int8_32) == 32);

using uint16_16 = Vector32<uint16>;
static_assert(alignof(uint16_16) == 32);

using int16_16 = Vector32<int16>;
static_assert(alignof(int16_16) == 32);

using uint32_8 = Vector32<uint32>;
static_assert(alignof(uint32_8) == 32);

using int32_8 = Vector32<int32>;
static_assert(alignof(int32_8) == 32);

using uint64_4 = Vector32<uint64>;
static_assert(alignof(uint64_4) == 32);

using int64_4 = Vector32<int64>;
static_assert(alignof(int64_4) == 32);

using float32_8 = Vector32<float32>;
static_assert(alignof(float32_8) == 32);

using float64_4 = Vector32<float64>;
static_assert(alignof(float64_4) == 32);

template<typename T>
using Vector64 = T __attribute__((vector_size(64), aligned(64)));

using char8_64 = Vector64<char8>;
static_assert(alignof(char8_64) == 64);

using char16_32 = Vector64<char16>;
static_assert(alignof(char16_32) == 64);

using char32_16 = Vector64<char32>;
static_assert(alignof(char32_16) == 64);

using uint8_64 = Vector64<uint8>;
static_assert(alignof(uint8_64) == 64);

using int8_64 = Vector64<int8>;
static_assert(alignof(int8_64) == 64);

using uint16_32 = Vector64<uint16>;
static_assert(alignof(uint16_32) == 64);

using int16_32 = Vector64<int16>;
static_assert(alignof(int16_32) == 64);

using uint32_16 = Vector64<uint32>;
static_assert(alignof(uint32_16) == 64);

using int32_16 = Vector64<int32>;
static_assert(alignof(int32_16) == 64);

using uint64_8 = Vector64<uint64>;
static_assert(alignof(uint64_8) == 64);

using int64_8 = Vector64<int64>;
static_assert(alignof(int64_8) == 64);

using float32_16 = Vector64<float32>;
static_assert(alignof(float32_16) == 64);

using float64_8 = Vector64<float64>;
static_assert(alignof(float64_8) == 64);


namespace Simd
{

    template<typename RegisterType>
    using ElementType = TypeTrait::Pure<decltype(RegisterType{}[0])>;

    template<typename RegisterType>
    inline consteval uint64 ElementSize()
    {
        return sizeof(ElementType<RegisterType>);
    }

    template<typename RegisterType>
    inline consteval uint64 NumElements()
    {
        return alignof(RegisterType) / ElementSize<RegisterType>();
    }

    INLINE void ZeroUpper()
    {
#ifdef AVX256
        BUILTIN(vzeroupper)();
#endif
    }

    INLINE void ZeroAll()
    {
#ifdef AVX256
        BUILTIN(vzeroall)();
#endif
    }

    template<typename RegisterType>
    INLINE constexpr RegisterType SetAll(ElementType<RegisterType> Value)
    {
        auto FillValues = [Value]<uint64... I>(TypeTrait::IndexSequence<I...>) -> RegisterType
        {
            return RegisterType{((void)I, Value)...};
        };

